from random import *
player = {
    'name': 'матиматичка', 
    'hp': 25,
    'damage': 0,
    'defence': 0,
    'money': 0,
    'rep': 10,
    'weapon': 'рука',
    'inventory': []
}

vrag = [
    {
        'name': 'двоечник', 
        'hp': 5,
        'attack': 2,
        'script': 'иди с дороги!!!',
        'win': 'ну только не к деректору(((',
        'loss': 'это тебе за ДВА!!!'
    },
    {
        'name': 'хорошист', 
        'hp': 7,
        'attack': 4,
        'script': 'почему три а не четыри?',
        'win': 'понел, понел',
        'loss': 'а я сильный)'
    },
    {
        'name': 'задира', 
        'hp': 12,
        'attack': 7,
        'script': 'слыш петёрка в журнал или фингал?!',
        'win': 'ОТВАЛИ ОТ МЕНЯЯ!:(',
        'loss': 'ПОНЕЛА ДУРА ТУПАЯ'
    },
    {
        'name': 'физичка', 
        'hp': 25,
        'attack': 10,
        'script': 'зачем ты поставила 2 алёше он у меня отличник',
        'win': 'ландо убидила',
        'loss': 'ну теперь точна 5 поставиш'
    }
]